app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "London"], ["short_name", "LD"], ["created_at", "2015-02-21 09:20:21.799379"], ["updated_at", "2015-02-21 09:20:21.799379"]]
---
  def create
    @city = City.new(city_params)
    if @city.save

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @city = City.find(params[:id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "cities" SET "name" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["name", "adads"], ["updated_at", "2015-02-23 15:34:35.352194"], ["id", 2]]
---
  def update
    @city = City.find(params[:id])
    if @city.update(city_params)

DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 1]]
---
  def destroy
    return unless @city.destroy

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_city
    @city ||= City.find(params[:id])